In [1]:
import pandas as pd

In [2]:
cgmDF = pd.read_csv('tblADataRTCGM_Blind_Baseline.csv')

In [3]:
cgmDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 772061 entries, 0 to 772060
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   RecID       772061 non-null  int64
 1   PtID        772061 non-null  int64
 2   DeviceDtTm  772061 non-null  object
 3   Glucose     772061 non-null  int64
dtypes: int64(3), object(1)
memory usage: 23.6+ MB

In [4]:
cgmDF.drop_duplicates()

           RecID  PtID                     DeviceDtTm  Glucose
0         196879   220  2000-04-28 18:20:14.010000000      129
1         196880   220  2000-04-28 18:25:14.010000000      132
2         196881   220  2000-04-28 18:30:14.010000000      126
3         196882   220  2000-04-28 18:35:14.010000000      120
4         196883   220  2000-04-28 18:40:14.010000000      118
...          ...   ...                            ...      ...
772056  11107424   115            2000-05-25 00:57:48       66
772057  11107425   115            2000-05-25 01:07:50       81
772058  11107426   115            2000-05-25 01:17:51       98
772059  11107427   115            2000-05-25 02:07:55      107
772060  11107428   115            2000-05-25 02:17:54      121

[772061 rows x 4 columns]

In [5]:
cgmDF.dropna()

           RecID  PtID                     DeviceDtTm  Glucose
0         196879   220  2000-04-28 18:20:14.010000000      129
1         196880   220  2000-04-28 18:25:14.010000000      132
2         196881   220  2000-04-28 18:30:14.010000000      126
3         196882   220  2000-04-28 18:35:14.010000000      120
4         196883   220  2000-04-28 18:40:14.010000000      118
...          ...   ...                            ...      ...
772056  11107424   115            2000-05-25 00:57:48       66
772057  11107425   115            2000-05-25 01:07:50       81
772058  11107426   115            2000-05-25 01:17:51       98
772059  11107427   115            2000-05-25 02:07:55      107
772060  11107428   115            2000-05-25 02:17:54      121

[772061 rows x 4 columns]

In [6]:
cgmDF['DeviceDtTm'] = cgmDF['DeviceDtTm'].astype('datetime64')

In [7]:
cgmDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 772061 entries, 0 to 772060
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   RecID       772061 non-null  int64
 1   PtID        772061 non-null  int64
 2   DeviceDtTm  772061 non-null  datetime64[ns]
 3   Glucose     772061 non-null  int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 23.6 MB

In [8]:
cgmDF.to_csv('CGM_Data.csv')